# NewAngularDimension Method (View, Arc, Reference, Reference, DimensionType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyItemFactory..::..NewAngularDimension Method (View, Arc, Reference, Reference, DimensionType)
FamilyItemFactory Class See Also
---
Creates a new angular dimension object using the specified dimension type.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Dimension NewAngularDimension(
	View view,
	Arc arc,
	Reference firstRef,
	Reference secondRef,
	DimensionType dimensionType
)
```

Visual Basic
---
```text
Public Function NewAngularDimension ( _
	view As View, _
	arc As Arc, _
	firstRef As Reference, _
	secondRef As Reference, _
	dimensionType As DimensionType _
) As Dimension
```

Visual C++
---
```text
public:
Dimension^ NewAngularDimension(
	View^ view,
	Arc^ arc,
	Reference^ firstRef,
	Reference^ secondRef,
	DimensionType^ dimensionType
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view in which the dimension is to be visible.
arc
    Type: Autodesk.Revit.DB..::..Arc The extension arc of the dimension.
firstRef
    Type: Autodesk.Revit.DB..::..Reference The first geometric reference to which the dimension is to be bound. The reference must be perpendicular to the extension arc.
secondRef
    Type: Autodesk.Revit.DB..::..Reference The second geometric reference to which the dimension is to be bound. The reference must be perpendicular to the extension arc.
dimensionType
    Type: Autodesk.Revit.DB..::..DimensionType The dimension style to be used for the dimension.
# ### Return Value
If creation was successful the new angular dimension is returned, otherwise an exception with failure information will be thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when any input argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the argument firstRef/secondRef/dimensionType is invalid. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the creation failed. |

# See Also
FamilyItemFactory Class
NewAngularDimension Overload
Autodesk.Revit.Creation Namespace